using System;

// Тернарний умовний оператор. Вкладені тернарні оператори.

namespace Condition
{
    class Program
    {
        static void Main()
        {
            // Визначення квадранта в якому лежить задана точка.
            // Для спрощення прикладу домовимося, що точка не лежатиме в центрі координат і на координатних осях,
            // це означає, що x і y - не можуть бути рівні 0.

            int x = 10, y = -5;


            // Не рекомендується вкладати тернарні оператори, так як це погіршує читання коду.


            string quadrant = (x > 0) ? ((y > 0) ? "I квадрант" : "IV квадрант") : ((y > 0) ? "II квадрант" : "III квадрант");

            // ... або так

            quadrant = x > 0 ? (y > 0 ? "I квадрант" : "IV квадрант") : (y > 0 ? "II квадрант" : "III квадрант");

            // ... або взагалі, ось так

            quadrant = x > 0 ? y > 0 ? "I квадрант" : "IV квадрант" : y > 0 ? "II квадрант" : "III квадрант";


            Console.WriteLine(quadrant);

            // Delay.
            Console.ReadKey();
        }
    }
}
