using System;

// Оператор багатозначного вибору - switch-case (перемикач). 

namespace Condition
{
    class Program
    {
        static void Main()
        {
            // Пропонуємо користувачеві ввести число.
            Console.WriteLine("Введіть число 1 або 2:");

            // Приймаємо введені дані від користувача.
            string number = Console.ReadLine();


            // На 21 рядку створюємо конструкцію багатозначного вибору, перемикач - switch,
            // якому в якості виразу-селектора, передаємо змінну - number.

            switch (number)  // (number) — вираз-селектора.
            {
                // У тілі перемикача switch-case, на 29 і 35 рядках,
                // створюємо два оператори case, з постійними виразами рівними "1" і "2" відповідно.

                // Якщо значення виразу-селектора співпаде з одним зі значень сталих виразів,
                // то виконується тіло оператора case, постійний вираз якого, збігається з виразом-селектора.

                case "1":    // "1" — постійний вираз.
                    {
                        Console.WriteLine("Один");                                       // Гілка 1
                        // Вихід з перемикача.
                        break;
                    }
                case "2":
                    {
                        Console.WriteLine("Два");                                        // Гілка 2
                        break;
                    }

                // На 44 рядку створюємо (необов'язковий) оператор default, тіло якого виконується в разі,
                // якщо значення виразу-селектора не збігається із жодним із значень сталих виразів. 

                default:
                    {
                        Console.WriteLine("Ви ввели значення відмінне від 1 і 2.");       // Гілка 3
                        break;
                    }

                    // Якщо в перемикачі відсутній оператор default, і жодна умова не виконується, ви отримаєте помилку.    
            }

            // Delay.
            Console.ReadKey();
        }
    }
}
